# Ccылка на игровую Карту 👇🏻 https://1.bp.blogspot.com/-IXplOdXWc70/VNcARys7KpI/AAAAAAAAZjI/H3Xb4GDPJHs/s1600
# /Labirint.png
#
# Помогаем Шарику найти косточку.
# Вам нужно написать код, который будет проверять правильно ли Шарик идет по лабиринту.
#
# То есть, вам нужно придумать реализацию системы управления и проверки решений. Управление: Вверх, вниз, влево,
# вправо через инпут или при нажатии клавиши, как хотите.
#
# УСЛОВИЯ :
#
# 1.	Если игрок выбрал оптимальное направление - выводим в консоль, что Шарик нашел правильный пути и даем
# следующий ход. 2.	Если Шарик пошел в сторону стены - пишем, что шарик ударился о стену, игра закончена. 3.	Если
# Шарик вернулся туда откуда пришел на предыдущем ходу - выводим шарик струсил и убежал, игра закончена. 4.	Если Шарик
# выбрал не оптимальный проход - выводим шарик заблудился, тоже заканчиваем игру. 5.	Если Шарик прошел через все
# оптимальные ходы - поздравляем с победой, завершаем игру.
#
# ДОПОЛНИТЕЛЬНОЕ ЗАДАНИЕ :
#
# Реализовать систему сохранений в JSON. При проигрыше предлагаем сохраниться, прогресс шарика сохраняется на той
# позиции с которой он сделал неправильный ход. При запуске новой игры происходит проверка на наличие сохранения.
# Если есть сохранение - предлагаем игроку загрузить его. При отказе удаляем сохранение и начинаем новую игру с нуля.


if __name__ == '__main__':
    pass
